# Essentials
brew "git"  # Latest git (has auto-completions)
brew "vim"  # Latest Vim (can access system clipboard)

# Languages
brew "node"   # NodeJS
brew "pyenv"  # Python
brew "rbenv"  # Ruby
brew "yarn"   # NodeJS package manager

# Services
brew "mysql@5.7"  # For Django project. This specific version supports Python library
brew "redis"	  # For Django project

# Libraries
brew "libmemcached"  # For Python memcached library
brew "zlib"  # For installing Python with pyenv

# Terminal enhancements
brew "bash-completion"
brew "bat"  # cat replacement
brew "exa"  # ls replacement
brew "git-radar"

# Productivity
brew "asana"	   # What are my tasks again?
brew "entr"        # Auto-run linter or test suite on file edit
brew "fasd"        # Open files without having to remember their exact names
brew "git-extras"  # Useful Git commands (e.g. standup)
brew "git-recent"  # Recently-edited branches
brew "howdoi"	   # Search online code snippets
brew "hub" 	   # GitHub-specific commands (e.g. create PR)
brew "ripgrep" 	   # Fast find in files

# Printers
brew "cowsay"
brew "figlet"
brew "hr"
